app/controllers/search_items_controller.rb

SELECT "search_items".* FROM "search_items" WHERE "search_items"."address" = '36 Cooper Square, New York, NY 10003, USA' LIMIT 1
INSERT INTO "search_items" ("address", "created_at", "distance", "name", "phone_number", "search_type", "updated_at", "url", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    address_results = SearchItem.full_address(search_params[:address])

    if !address_results
      flash.now[:errors] = ["Hmm, invalid address. Try again!"]
      render :new
    else

      @address = address_results[:address]
      @zip = address_results[:zip]
      @searches = (SearchItem.where(address: @address) || [])

      if @searches.length == 0
        searches = SearchItem.wifi_locations(@address, @zip)
        searches.each do |search|
          search_item = SearchItem.new()
          search_item.name = search.shift
          search_item.address = @address
          search_item.distance = search.pop
          search_item.search_type = "wifi"
          search.each do |el|
            search_item.url = el if el.match(/[a-z0-9]+([\-\.]{1}[a-z0-9]+)*\.[a-z]{2,5}(([0-9]{1,5})?\/.*)?$/ix)
            search_item.phone_number = el if el.match(/^(?:(?:\+?1\s*(?:[.-]\s*)?)?(?:\(\s*([2-9]1[02-9]|[2-9][02-8]1|[2-9][02-8][02-9])\s*\)|([2-9]1[02-9]|[2-9][02-8]1|[2-9][02-8][02-9]))\s*(?:[.-]\s*)?)?([2-9]1[02-9]|[2-9][02-9]1|[2-9][02-9]{2})\s*(?:[.-]\s*)?([0-9]{4})(?:\s*(?:#|x\.?|ext\.?|extension)\s*(\d+))?$/)
          end
          search_item.user_id = current_user.id
          search_item.save!